tsung_test_ns.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/mkhomenkov/tsung/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0" backend="fullstats">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="70000"/>
  </clients>
  
  <!-- Server side setup -->
  <servers>
    <server host="127.0.0.1" port="8080" type="tcp"></server>
    <server host="127.0.0.1" port="8080" type="tcp"></server>
  </servers>

  <monitoring>
    <monitor host="vbx.scc.local" type="erlang"/>
  </monitoring>
  
  <load duration="60" unit="minute">
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
   <arrivalphase phase="1" duration="60" unit="minute">
     <users arrivalrate="25" unit="second"></users>
   </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
  </options>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
  <session name="http-example" probability="100" type="ts_http">

    <!-- full url with server name, this overrides the "server" config value -->
    <thinktime min="5" max="15" random="true"></thinktime>
    <transaction name="tre1">
      <request> <http url="/test1" method="GET" version="1.1"></http> </request>
      <request> <http url="/test1" method="GET" version="1.1"></http> </request>
      <request> <http url="/test1" method="GET" version="1.1"></http> </request>
      <request> <http url="/test1" method="GET" version="1.1"></http> </request>
    </transaction>
    <request> <http url="/test1" method="GET" version="1.1"></http> </request>
    <request> <http url="/test1" method="GET" version="1.1"></http> </request>
    <request> <http url="/test1" method="GET" version="1.1"></http> </request>
    <request> <http url="/test1" method="GET" version="1.1"></http> </request>
    <request> <http url="/test1" method="GET" version="1.1"></http> </request>
    <request> <http url="/test1" method="GET" version="1.1"></http> </request>
    <request> <http url="/test1" method="GET" version="1.1"></http> </request>
    
    <thinktime min="5" max="15" random="true"></thinktime>
    

  </session>
 </sessions>
</tsung>